# Задача 1:
# **Умова:**
# Користувач вводить з клавіатури арифметичний вираз. Наприклад, 23+12. Необхідно
# вивести на екран результат виразу. У нашому прикладі це 35. Арифметичний вираз може
# складатися лише з трьох частин: число, операція, число. Можливі операції: +, -, *, /
# **Вхідні дані:**
# - Користувач вводить арифметичний вираз.
# **Вихідні дані:**
# - Вивести на екран результат обчислення виразу.

# a = eval(input("Enter num: "))
# print(a)

# ### Задача 2:
# **Умова:**
# У списку цілих чисел, заповненому випадковими числами, визначити мінімальний і
# максимальний елементи, порахувати кількість від'ємних елементів, порахувати кількість
# додатних елементів, порахувати кількість нулів. Результати вивести на екран.
# **Вхідні дані:**
# - Список цілих чисел, заповнений випадковими числами.
# **Вихідні дані:**
# - Мінімальний та максимальний елементи.
# - Кількість від'ємних, додатних та нульових елементів.

# import random
#
# a = []
# posit = 0
# neg = 0
# num_zero = 0
# for i in range(20):
#     b = random.randint(-10, 10)
#     a.append(b)
# print(a)
# for i in a:
#     if i > 0:
#         posit = posit + 1
# print(f"Positive: ", {posit})
# for i in a:
#     if i < 0:
#         neg = neg + 1
# print(f"Negative: ", {neg})
# for i in a:
#     if i == 0:
#         num_zero = num_zero + 1
# print(f"Zero: ", {num_zero})
# print(f"Maximal: ", max(a))
# print(f"Minimal: ", min(a))

# ### Задача 3:
# **Умова:**
# Два списки цілих чисел заповнюються випадковими числами. Необхідно:
# 1. Сформувати третій список, що містить елементи обох списків.
# 2. Сформувати третій список, що містить елементи обох списків без повторень.
# 3. Сформувати третій список, що містить елементи, спільні для двох списків.
# 4. Сформувати третій список, що містить лише унікальні елементи кожного зі списків.
# 5. Сформувати третій список, що містить лише мінімальне та максимальне значення
# кожного зі списків.

# import random
# a = []
# b = []
#
# for i in range(10):
#     x = random.randint(0, 10)
#     a.append(x)
# print(f'Перший список: ', a)
# for i in range(10):
#     c = random.randint(0,10)
#     b.append(c)
# print(f'Другий список: ', b)
#
# print(f'Список, що містить елементи обох списків: ', a + b)
#
# unique_elements = list(set(a + b))
# print(f'Список, що містить унікальні елементи кожного зі списків: ', unique_elements)
#
# print(f'Список, що містить елементи, спільні для двох списків: ', list(set(a) & set(b)))
#
# min_max = [max(a + b), min(a + b)]
# print(f'Список, мінімальне та максимальне значення: ', min_max)

# ### Задача 4:
# **На кортежі:**
# 1. **Створити кортеж:**
# - Створити кортеж, який містить кілька різних типів даних (цілі числа, рядки, дійсні
# числа). Вивести цей кортеж на екран.

# a = -1, 5, "Hallo", 8
# print(a)

# 2. **Зміна кортежу:**
# - Створити кортеж чисел. Змінити один з елементів кортежу та вивести змінений кортеж на екран.

# Відповідь: кортеж є незмінною колекцією даних.

# ### Задача 5:
# **На словники:**
# 1. **Операції зі словниками:**
# - Створити словник, що містить дані про деякий товар (наприклад, назва, ціна, кількість).
# Додати новий товар до словника та вивести оновлений словник на екран.

# a = {'Книжка 1': 'Гарі Поттер',
#      'Книжка 2': 'Володар кілець',
#      'Книжка 3': 2022}
# print(a)
# a["Книжка 4"] = 'Правила дорожнього руху'
# print(a)

# 2. **Пошук та виведення:**
# - Створити словник, що містить інформацію про книги (назва, автор, рік видання).
# Здійснити пошук за назвою книги та вивести інформацію про неї.

# a = {'Гаррі Поттер': '450 грн',
#      'Володар кілець': '400 грн',
#      'Правила дорожнього руху': '300грн'}
# print(a)
# print(a["Гаррі Поттер"])
# print(a['Володар кілець'])
# print(a['Правила дорожнього руху'])

# 3. **Видалення елементу:**
# - Створити словник, що містить дані про студентів (ім'я, прізвище, середній бал).
# Видалити інформацію про одного зі студентів та вивести оновлений словник на екран.

# student = {'Корнієнко Олексій': 5,
#            'Полченко Марина': 4,
#            'Марченко Іван': 3}
# print(student)
# del student['Марченко Іван']
# print(student)

# ### Задача 6:
# **На множини:**
# 1. **Операції з множинами чисел:**
# - Створити дві множини цілих чисел. Знайти їх об'єднання, різницю та перетин. Вивести
# результати на екран.

# a = {1, 3, 4, 6, 7, 0}
# b = {3, 5, 8, 0, 9, 1}
#
# print(a & b) #Перетин
# print(a.union(b)) #Об'єднання
# print(a - b)
# print(b - a)

# 2. **Множина підмножин:**
# - Створити дві множини. Перевірити, чи є одна з них підмножиною іншої, та вивести
# результат.

# users_tiktok = {"Anna", "Tom", "Mikki"}
# users_instagram = {'Marco', "Natali", "Anna", "Tom", "Mikki", "Sofia"}
# print(users_tiktok.issubset(users_instagram))

# 3. **Операції з символами:**
# - Створити дві множини символів (літери алфавіту). Знайти їх об'єднання, різницю та
# перетин. Вивести результати на екран.

# a = {"a", 's', 'd', 'g', 'h'}
# b = {'s', 'd', 'c', 'b', 'n'}
#
# print(a.union(b))
# print(a & b)
# print(a - b)

# 4. **Додавання та видалення елементів:**
# - Створити множину слів. Додати нове слово та видалити існуюче. Вивести оновлену
# множину на екран

# words = {"Goodness", 'Joy', 'Pride', 'Happines', 'Peace'}
# print(words)
# words.add("Sunlight")
# print(words)
# words.remove('Pride')
# print(words)
