# Завданя 1:
# Користувач вводить три цифри з клавіатури.
# Залежно від вибору користувача, програма виводить на екран суму трьох чисел або добуток трьох чисел.

# a = int(input("Введіть перше число: "))
# b = int(input("Введіть друге число: "))
# c = int(input("Введіть третє число: "))
# print(a + b + c)
# # suma = a + b + c
# # print(suma)


# Завдання 2
# Користувач вводить три цифри з клавіатури.
# Залежно від вибору користувача програма виводить на екран максимум із трьох,
# мінімум із трьох або середнеарифметичне трьох чисел.

# a = int(input("Введіть перше число: "))
# b = int(input("Введіть друге число: "))
# c = int(input("Введіть третє число: "))
# print(max(a, b, c))
# print(min(a, b, c))
# d = (a + b + c) / 3
# print(d)


# Завдання 3
# Користувач вводить з клавіатури номер дня тижня
# (1-7). Необхідно вивести на екран назви дня тижня. Наприклад, якщо 1, то на екрані напис понеділок, 2 - вівторок і т.д.

# day = int(input("Введіть номер сьогоднішнього дня: "))
# if day == 1:
#     print("Понеділок")
# if day == 2:
#     print("Вівторок")
# if day == 3:
#     print("Середа")
# if day == 4:
#     print("Четвер")
# if day == 5:
#     print("Пятниця")
# if day == 6:
#     print("Субота")
# if day == 7:
#     print("Неділя")
# else:
#     print("То вже лишнє")

# day = ["Понеділок", "Вівторок", "Середа", "Четвер", "П'ятниця", "Субота", "Неділя"]
# number_day = int(input("Ведіть число дня тижня: "))
# if number_day >= 1 and number_day <= 7:
#     day_name = day[number_day - 1]
#     print(day_name)
# else:
#     print('Добре подумай і спробуй ще')


# Завдання 4
# Користувач вводить з клавіатури номер місяця (1-12). Необхідно вивести на екран назву місяця.
# Наприклад, якщо 1, то на екрані напис січень, 2 - лютий і т.д.

# months = ['Січень', 'Лютий', 'Березень', 'Квітень',
#           'Травень', 'Червень', 'Липень', 'Серпень',
#           'Вересень', 'Жовтень', 'Листопад', 'Грудень']
# months_number = int(input('Напишіть число місяця: '))
# if months_number >=1 and months_number <= 12:
#     months_name = months[months_number - 1]
#     print(months_name)
# else:
#     print("Некоректне значення")
# #
# Завдання 5
# Користувач вводить із клавіатури число. Якщо число
# більше нуля потрібно вивести напис "Number is positive", якщо менше нуля "Number is negative",
# якщо дорівнює нулю «Number is equal to zero»

# nums = int(input("Введіть число: "))
# if nums > 0:
#     print("Number is positive")
# if nums == 0:
#     print("Number is equal to zero")
# if nums < 0:
#         print("Number is negative")

# Завдання 6
# # Користувач вводить два числа. Визначити, чи рівні ці числа, і, якщо ні, вивести їх на екран у порядку зростання.
# a = int(input("a: "))
# b = int(input("b: "))
# if a != b:
#     print(max(a, b))
#     print(min(a, b))
#

# Завдання 7
# Користувач вводить з клавіатури два числа (початок та кінець діапазону).
# Потрібно проаналізувати всі числа в цьому діапазоні за таким правилом: якщо
# число кратно 7 його треба виводити на екран.

# a = int(input("a: "))
# b = int(input("b: "))
#
# for i in range(a, b + 1):
#     if i % 7 == 0:
#         print(i)

# Завдання 8
# Користувач вводить з клавіатури два числа (початок та кінець діапазону).
# Потрібно проаналізувати все числа у цьому діапазоні.
# Потрібно вивести на екран:
# 1. Усі числа діапазону;
# 2. Усі числа діапазону у спадному порядку;
# 3. Усі числа, кратні 7;
# 4. Кількість чисел, кратних 5.

# a = 3 #int(input("a: "))
# b = 90 #int(input("b: "))
# c = 0
# for i in range(a, b + 1):
#     print(i)
# for i in range (b, a - 1, -1):
#     print(i)
# for i in range(a, b + 1):
#     if i % 7 == 0:
#         print(i)
# for i in range(a, b + 1):
#     if i % 5 == 0:
#         c = c + 1
# print(c)


# Завдання 9
# Користувач вводить з клавіатури два числа (початок та кінець діапазону).
# Потрібно проаналізувати усі числа у цьому діапазоні.
# Виведення на екран має відбуватися за правилами, наведеними нижче.
# Якщо число кратне 3 (ділиться на 3 без залишку), потрібно вивести слово Fizz.
# Якщо число разів 5 потрібно вивести слово Buzz. Якщо число кратно 3 та 5 потрібно вивести Fizz Buzz.
# Якщо число не раз не 3 і 5 потрібно вивести саме число.

# a = 3 #int(input("a: "))
# b = 90 #int(input("b: "))
# for i in range(a, b + 1):
#     if i % 5 == 0:
#         if i % 3 == 0:
#             print("Fizz Buss")
#         else:
#             print("Buzz")
#     elif i % 3 == 0:
#         print("Fizz")
#     else:
#         print(i)


